# Домашнее задание по теме "Библиотека pandas"

(Выполнил: Черевко Владимир)

## Задание 1

In [1]:
import pandas as pd

In [3]:
movies_df = pd.read_csv('movies.csv')
movies_df.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [4]:
ratings_df = pd.read_csv('ratings.csv')
ratings_df.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [5]:
movies_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9742 entries, 0 to 9741
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   movieId  9742 non-null   int64
 1   title    9742 non-null   object
 2   genres   9742 non-null   object
dtypes: int64(1), object(2)
memory usage: 228.5+ KB

In [6]:
ratings_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100836 entries, 0 to 100835
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   userId     100836 non-null  int64
 1   movieId    100836 non-null  int64
 2   rating     100836 non-null  float64
 3   timestamp  100836 non-null  int64
dtypes: float64(1), int64(3)
memory usage: 3.1 MB

В датасетах нет пропусков данных (все столбцы non-null). Посмотрим максимально возможный рейтинг.

In [8]:
ratings_df.rating.unique().max()

5.0

In [16]:
ratings_df[ratings_df["rating"] == 5.].groupby("movieId").count().sort_values(by="rating", ascending=False).head(1).merge(movies_df, on='movieId', how='left')

,movieId,userId,rating,timestamp,title,genres
0,318,153,153,153,"Shawshank Redemption, The (1994)",Crime|Drama

### Ответ: больше всего оценок было выставлено фильму: "Shawshank Redemption, The (1994)"

## Задание 2

In [17]:
power_df = pd.read_csv('power.csv')
power_df.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [19]:
power_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1189482 entries, 0 to 1189481
Data columns (total 4 columns):
 #   Column    Non-Null Count    Dtype
---  ------    --------------    -----
 0   country   1189482 non-null  object
 1   year      1189482 non-null  int64
 2   quantity  1189482 non-null  float64
 3   category  1189482 non-null  int64
dtypes: float64(1), int64(2), object(1)
memory usage: 36.3+ MB

В данных нет пропусков. Посмотрим, как может выглядеть название искомых государств, по окончанию на "ia". Перед этим, максимально сократив выборку, чтобы было проще искать визуально.

In [32]:
power_df[(power_df["year"] >= 2005) & (power_df["year"] <= 2010) & 
((power_df["category"] == 4) | (power_df["category"] == 12) | (power_df["category"] == 21)) & 
(power_df["quantity"] >= 0) &
(power_df["country"].str.contains('ia', case=False))]["country"].unique()

array(['Colombia', 'Australia', 'Austria', 'Bolivia (Plur. State of)',
       'Bulgaria', 'Croatia', 'Czechia', 'Estonia', 'French Guiana',
       'Indonesia', 'Liberia', 'Lithuania', 'Mauritania', 'New Caledonia',
       'Romania', 'Russian Federation', 'Slovakia', 'Slovenia',
       'T.F.Yug.Rep. Macedonia', 'Georgia', 'Latvia', 'French Polynesia',
       'Malaysia', 'Namibia', 'Serbia', 'Zambia',
       'Bosnia and Herzegovina', 'India', 'Mongolia', 'Other Asia',
       'Albania', 'Cambodia', 'Nigeria', 'Tunisia', 'Saudi Arabia',
       'Algeria', 'Armenia', 'Equatorial Guinea', 'Ethiopia', 'Gambia',
       'Micronesia (Fed. States of)', 'Northern Mariana Islands',
       'Somalia', 'St. Lucia', 'Syrian Arab Republic',
       'United Rep. of Tanzania'], dtype=object)

Судя по всему в данном интервале они называются Lithuania и Latvia, а Эстония называется Estonia. Добавим их в фильтры.

In [36]:
power_df[(power_df["year"] >= 2005) & (power_df["year"] <= 2010) & 
((power_df["category"] == 4) | (power_df["category"] == 12) | (power_df["category"] == 21)) & 
(power_df["quantity"] >= 0) &
((power_df["country"] == "Lithuania") | (power_df["country"] == "Latvia") | (power_df["country"] == "Estonia"))]["quantity"].sum()

240580.0

### Ответ: суммарное потребление энергии странами Прибалтики = 240580.

## Задание 3

Выведем значения таблицы Брадиса для синусов и косинусов с web-страницы, для первых 10 углов. Заголовок сделаем как нулевую строку таблицы, а индекс привяжем к колонке с углами.

In [9]:
table_ds = pd.read_html("https://ru.onlinemschool.com/math/formula/bradis_table/", header = 0, index_col = 0)[0]
table_ds.head(12)

,0',6',12',18',24',30',36',42',48',54',60',cos,1',2',3'
sin,,,,,,,,,,,,,,,
NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0000,90°,NaN,NaN,NaN
0°,0.0000,0017,0035,0052,0070,0087,0105,0122,0140,0157,0175,89°,3,6,9
1°,0175,0192,0209,0227,0244,0262,0279,0297,0314,0332,0349,88°,3,6,9
2°,0349,0366,0384,0401,0419,0436,0454,0471,0488,0506,0523,87°,3,6,9
3°,0523,0541,0558,0576,0593,0610,0628,0645,0663,0680,0698,86°,3,6,9
4°,0698,0715,0732,0750,0767,0785,0802,0819,0837,0854,0.0872,85°,3,6,9
NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5°,0.0872,0889,0906,0924,0941,0958,0976,0993,1011,1028,1045,84°,3,6,9
6°,1045,1063,1080,1097,1115,1132,1149,1167,1184,1201,1219,83°,3,6,9
7°,1219,1236,1253,1271,1288,1305,1323,1340,1357,1374,1392,82°,3,6,9
8°,1392,1409,1426,1444,1461,1478,1495,1513,1530,1547,1564,81°,3,6,9
9°,1564,1582,1599,1616,1633,1650,1668,1685,1702,1719,0.1736,80°,3,6,9